mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2hgxg/common/s6e2hgxg.h
#define bFM_CAN0_STATR_TXOK                       *((volatile  uint8_t *)(0x42C4004CUL))
#define bFM4_CAN0_STATR_TXOK                      *((volatile  uint8_t *)(0x42C4004CUL))
#define bFM_CAN0_STATR_RXOK                       *((volatile  uint8_t *)(0x42C40050UL))
#define bFM4_CAN0_STATR_RXOK                      *((volatile  uint8_t *)(0x42C40050UL))
#define bFM_CAN0_STATR_EPASS                      *((volatile  uint8_t *)(0x42C40054UL))
#define bFM4_CAN0_STATR_EPASS                     *((volatile  uint8_t *)(0x42C40054UL))
#define bFM_CAN0_STATR_EWARN                      *((volatile  uint8_t *)(0x42C40058UL))
#define bFM4_CAN0_STATR_EWARN                     *((volatile  uint8_t *)(0x42C40058UL))
#define bFM_CAN0_STATR_BOFF                       *((volatile  uint8_t *)(0x42C4005CUL))
#define bFM4_CAN0_STATR_BOFF                      *((volatile  uint8_t *)(0x42C4005CUL))

#define bFM_CAN0_TESTR_BASIC                      *((volatile  uint8_t *)(0x42C40148UL))
#define bFM4_CAN0_TESTR_BASIC                     *((volatile  uint8_t *)(0x42C40148UL))
#define bFM_CAN0_TESTR_SILENT                     *((volatile  uint8_t *)(0x42C4014CUL))
#define bFM4_CAN0_TESTR_SILENT                    *((volatile  uint8_t *)(0x42C4014CUL))
#define bFM_CAN0_TESTR_LBACK                      *((volatile  uint8_t *)(0x42C40150UL))
#define bFM4_CAN0_TESTR_LBACK                     *((volatile  uint8_t *)(0x42C40150UL))
#define bFM_CAN0_TESTR_RX                         *((volatile  uint8_t *)(0x42C4015CUL))
#define bFM4_CAN0_TESTR_RX                        *((volatile  uint8_t *)(0x42C4015CUL))

#define bFM_CAN0_TREQR_TXRQST1                    *((volatile  uint8_t *)(0x42C41000UL))
#define bFM4_CAN0_TREQR_TXRQST1                   *((volatile  uint8_t *)(0x42C41000UL))
#define bFM_CAN0_TREQR_TXRQST2                    *((volatile  uint8_t *)(0x42C41004UL))
#define bFM4_CAN0_TREQR_TXRQST2                   *((volatile  uint8_t *)(0x42C41004UL))
#define bFM_CAN0_TREQR_TXRQST3                    *((volatile  uint8_t *)(0x42C41008UL))
#define bFM4_CAN0_TREQR_TXRQST3                   *((volatile  uint8_t *)(0x42C41008UL))
#define bFM_CAN0_TREQR_TXRQST4                    *((volatile  uint8_t *)(0x42C4100CUL))
#define bFM4_CAN0_TREQR_TXRQST4                   *((volatile  uint8_t *)(0x42C4100CUL))
#define bFM_CAN0_TREQR_TXRQST5                    *((volatile  uint8_t *)(0x42C41010UL))
#define bFM4_CAN0_TREQR_TXRQST5                   *((volatile  uint8_t *)(0x42C41010UL))
#define bFM_CAN0_TREQR_TXRQST6                    *((volatile  uint8_t *)(0x42C41014UL))
#define bFM4_CAN0_TREQR_TXRQST6                   *((volatile  uint8_t *)(0x42C41014UL))
#define bFM_CAN0_TREQR_TXRQST7                    *((volatile  uint8_t *)(0x42C41018UL))
#define bFM4_CAN0_TREQR_TXRQST7                   *((volatile  uint8_t *)(0x42C41018UL))
#define bFM_CAN0_TREQR_TXRQST8                    *((volatile  uint8_t *)(0x42C4101CUL))
#define bFM4_CAN0_TREQR_TXRQST8                   *((volatile  uint8_t *)(0x42C4101CUL))
#define bFM_CAN0_TREQR_TXRQST9                    *((volatile  uint8_t *)(0x42C41020UL))
#define bFM4_CAN0_TREQR_TXRQST9                   *((volatile  uint8_t *)(0x42C41020UL))
#define bFM_CAN0_TREQR_TXRQST10                   *((volatile  uint8_t *)(0x42C41024UL))
#define bFM4_CAN0_TREQR_TXRQST10                  *((volatile  uint8_t *)(0x42C41024UL))
#define bFM_CAN0_TREQR_TXRQST11                   *((volatile  uint8_t *)(0x42C41028UL))
#define bFM4_CAN0_TREQR_TXRQST11                  *((volatile  uint8_t *)(0x42C41028UL))
#define bFM_CAN0_TREQR_TXRQST12                   *((volatile  uint8_t *)(0x42C4102CUL))
#define bFM4_CAN0_TREQR_TXRQST12                  *((volatile  uint8_t *)(0x42C4102CUL))
#define bFM_CAN0_TREQR_TXRQST13                   *((volatile  uint8_t *)(0x42C41030UL))
#define bFM4_CAN0_TREQR_TXRQST13                  *((volatile  uint8_t *)(0x42C41030UL))
#define bFM_CAN0_TREQR_TXRQST14                   *((volatile  uint8_t *)(0x42C41034UL))
#define bFM4_CAN0_TREQR_TXRQST14                  *((volatile  uint8_t *)(0x42C41034UL))
#define bFM_CAN0_TREQR_TXRQST15                   *((volatile  uint8_t *)(0x42C41038UL))
#define bFM4_CAN0_TREQR_TXRQST15                  *((volatile  uint8_t *)(0x42C41038UL))
#define bFM_CAN0_TREQR_TXRQST16                   *((volatile  uint8_t *)(0x42C4103CUL))
#define bFM4_CAN0_TREQR_TXRQST16                  *((volatile  uint8_t *)(0x42C4103CUL))
#define bFM_CAN0_TREQR_TXRQST17                   *((volatile  uint8_t *)(0x42C41040UL))
#define bFM4_CAN0_TREQR_TXRQST17                  *((volatile  uint8_t *)(0x42C41040UL))
#define bFM_CAN0_TREQR_TXRQST18                   *((volatile  uint8_t *)(0x42C41044UL))
#define bFM4_CAN0_TREQR_TXRQST18                  *((volatile  uint8_t *)(0x42C41044UL))
#define bFM_CAN0_TREQR_TXRQST19                   *((volatile  uint8_t *)(0x42C41048UL))
#define bFM4_CAN0_TREQR_TXRQST19                  *((volatile  uint8_t *)(0x42C41048UL))
#define bFM_CAN0_TREQR_TXRQST20                   *((volatile  uint8_t *)(0x42C4104CUL))
#define bFM4_CAN0_TREQR_TXRQST20                  *((volatile  uint8_t *)(0x42C4104CUL))
#define bFM_CAN0_TREQR_TXRQST21                   *((volatile  uint8_t *)(0x42C41050UL))
#define bFM4_CAN0_TREQR_TXRQST21                  *((volatile  uint8_t *)(0x42C41050UL))
#define bFM_CAN0_TREQR_TXRQST22                   *((volatile  uint8_t *)(0x42C41054UL))
#define bFM4_CAN0_TREQR_TXRQST22                  *((volatile  uint8_t *)(0x42C41054UL))
#define bFM_CAN0_TREQR_TXRQST23                   *((volatile  uint8_t *)(0x42C41058UL))
#define bFM4_CAN0_TREQR_TXRQST23                  *((volatile  uint8_t *)(0x42C41058UL))
#define bFM_CAN0_TREQR_TXRQST24                   *((volatile  uint8_t *)(0x42C4105CUL))
#define bFM4_CAN0_TREQR_TXRQST24                  *((volatile  uint8_t *)(0x42C4105CUL))
#define bFM_CAN0_TREQR_TXRQST25                   *((volatile  uint8_t *)(0x42C41060UL))
#define bFM4_CAN0_TREQR_TXRQST25                  *((volatile  uint8_t *)(0x42C41060UL))
#define bFM_CAN0_TREQR_TXRQST26                   *((volatile  uint8_t *)(0x42C41064UL))
#define bFM4_CAN0_TREQR_TXRQST26                  *((volatile  uint8_t *)(0x42C41064UL))
#define bFM_CAN0_TREQR_TXRQST27                   *((volatile  uint8_t *)(0x42C41068UL))
#define bFM4_CAN0_TREQR_TXRQST27                  *((volatile  uint8_t *)(0x42C41068UL))
#define bFM_CAN0_TREQR_TXRQST28                   *((volatile  uint8_t *)(0x42C4106CUL))
#define bFM4_CAN0_TREQR_TXRQST28                  *((volatile  uint8_t *)(0x42C4106CUL))
#define bFM_CAN0_TREQR_TXRQST29                   *((volatile  uint8_t *)(0x42C41070UL))
#define bFM4_CAN0_TREQR_TXRQST29                  *((volatile  uint8_t *)(0x42C41070UL))
#define bFM_CAN0_TREQR_TXRQST30                   *((volatile  uint8_t *)(0x42C41074UL))
#define bFM4_CAN0_TREQR_TXRQST30                  *((volatile  uint8_t *)(0x42C41074UL))
#define bFM_CAN0_TREQR_TXRQST31                   *((volatile  uint8_t *)(0x42C41078UL))
#define bFM4_CAN0_TREQR_TXRQST31                  *((volatile  uint8_t *)(0x42C41078UL))
#define bFM_CAN0_TREQR_TXRQST32                   *((volatile  uint8_t *)(0x42C4107CUL))
#define bFM4_CAN0_TREQR_TXRQST32                  *((volatile  uint8_t *)(0x42C4107CUL))


