mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2hgxg/common/s6e2hgxg.h
#define bFM_INTREQ_IRQ068MON_MFSINT4_RX           *((volatile  uint8_t *)(0x42626280UL))
#define bFM4_INTREQ_IRQ068MON_MFSINT4_RX          *((volatile  uint8_t *)(0x42626280UL))

#define bFM_INTREQ_IRQ069MON_MFSINT4_TX           *((volatile  uint8_t *)(0x42626300UL))
#define bFM4_INTREQ_IRQ069MON_MFSINT4_TX          *((volatile  uint8_t *)(0x42626300UL))
#define bFM_INTREQ_IRQ069MON_MFSINT4_STATUS       *((volatile  uint8_t *)(0x42626304UL))
#define bFM4_INTREQ_IRQ069MON_MFSINT4_STATUS      *((volatile  uint8_t *)(0x42626304UL))

#define bFM_INTREQ_IRQ070MON_MFSINT5_RX           *((volatile  uint8_t *)(0x42626380UL))
#define bFM4_INTREQ_IRQ070MON_MFSINT5_RX          *((volatile  uint8_t *)(0x42626380UL))

#define bFM_INTREQ_IRQ071MON_MFSINT5_TX           *((volatile  uint8_t *)(0x42626400UL))
#define bFM4_INTREQ_IRQ071MON_MFSINT5_TX          *((volatile  uint8_t *)(0x42626400UL))
#define bFM_INTREQ_IRQ071MON_MFSINT5_STATUS       *((volatile  uint8_t *)(0x42626404UL))
#define bFM4_INTREQ_IRQ071MON_MFSINT5_STATUS      *((volatile  uint8_t *)(0x42626404UL))

#define bFM_INTREQ_IRQ072MON_MFSINT6_RX           *((volatile  uint8_t *)(0x42626480UL))
#define bFM4_INTREQ_IRQ072MON_MFSINT6_RX          *((volatile  uint8_t *)(0x42626480UL))

#define bFM_INTREQ_IRQ073MON_MFSINT6_TX           *((volatile  uint8_t *)(0x42626500UL))
#define bFM4_INTREQ_IRQ073MON_MFSINT6_TX          *((volatile  uint8_t *)(0x42626500UL))
#define bFM_INTREQ_IRQ073MON_MFSINT6_STATUS       *((volatile  uint8_t *)(0x42626504UL))
#define bFM4_INTREQ_IRQ073MON_MFSINT6_STATUS      *((volatile  uint8_t *)(0x42626504UL))

#define bFM_INTREQ_IRQ074MON_MFSINT7_RX           *((volatile  uint8_t *)(0x42626580UL))
#define bFM4_INTREQ_IRQ074MON_MFSINT7_RX          *((volatile  uint8_t *)(0x42626580UL))

#define bFM_INTREQ_IRQ075MON_MFSINT7_TX           *((volatile  uint8_t *)(0x42626600UL))
#define bFM4_INTREQ_IRQ075MON_MFSINT7_TX          *((volatile  uint8_t *)(0x42626600UL))
#define bFM_INTREQ_IRQ075MON_MFSINT7_STATUS       *((volatile  uint8_t *)(0x42626604UL))
#define bFM4_INTREQ_IRQ075MON_MFSINT7_STATUS      *((volatile  uint8_t *)(0x42626604UL))

#define bFM_INTREQ_IRQ076MON_ADCINT0              *((volatile  uint8_t *)(0x42626680UL))
#define bFM4_INTREQ_IRQ076MON_ADCINT0             *((volatile  uint8_t *)(0x42626680UL))
#define bFM_INTREQ_IRQ076MON_ADCINT1              *((volatile  uint8_t *)(0x42626684UL))
#define bFM4_INTREQ_IRQ076MON_ADCINT1             *((volatile  uint8_t *)(0x42626684UL))
#define bFM_INTREQ_IRQ076MON_ADCINT2              *((volatile  uint8_t *)(0x42626688UL))
#define bFM4_INTREQ_IRQ076MON_ADCINT2             *((volatile  uint8_t *)(0x42626688UL))
#define bFM_INTREQ_IRQ076MON_ADCINT3              *((volatile  uint8_t *)(0x4262668CUL))
#define bFM4_INTREQ_IRQ076MON_ADCINT3             *((volatile  uint8_t *)(0x4262668CUL))
#define bFM_INTREQ_IRQ076MON_ADCINT4              *((volatile  uint8_t *)(0x42626690UL))
#define bFM4_INTREQ_IRQ076MON_ADCINT4             *((volatile  uint8_t *)(0x42626690UL))

#define bFM_INTREQ_IRQ077MON_ADCINT0              *((volatile  uint8_t *)(0x42626700UL))
#define bFM4_INTREQ_IRQ077MON_ADCINT0             *((volatile  uint8_t *)(0x42626700UL))
#define bFM_INTREQ_IRQ077MON_ADCINT1              *((volatile  uint8_t *)(0x42626704UL))
#define bFM4_INTREQ_IRQ077MON_ADCINT1             *((volatile  uint8_t *)(0x42626704UL))
#define bFM_INTREQ_IRQ077MON_ADCINT2              *((volatile  uint8_t *)(0x42626708UL))
#define bFM4_INTREQ_IRQ077MON_ADCINT2             *((volatile  uint8_t *)(0x42626708UL))
#define bFM_INTREQ_IRQ077MON_ADCINT3              *((volatile  uint8_t *)(0x4262670CUL))
#define bFM4_INTREQ_IRQ077MON_ADCINT3             *((volatile  uint8_t *)(0x4262670CUL))
#define bFM_INTREQ_IRQ077MON_ADCINT4              *((volatile  uint8_t *)(0x42626710UL))
#define bFM4_INTREQ_IRQ077MON_ADCINT4             *((volatile  uint8_t *)(0x42626710UL))

#define bFM_INTREQ_IRQ078MON_USB_DRQ_INT0         *((volatile  uint8_t *)(0x42626780UL))
#define bFM4_INTREQ_IRQ078MON_USB_DRQ_INT0        *((volatile  uint8_t *)(0x42626780UL))
#define bFM_INTREQ_IRQ078MON_USB_DRQ_INT1         *((volatile  uint8_t *)(0x42626784UL))
#define bFM4_INTREQ_IRQ078MON_USB_DRQ_INT1        *((volatile  uint8_t *)(0x42626784UL))
#define bFM_INTREQ_IRQ078MON_USB_DRQ_INT2         *((volatile  uint8_t *)(0x42626788UL))
#define bFM4_INTREQ_IRQ078MON_USB_DRQ_INT2        *((volatile  uint8_t *)(0x42626788UL))
#define bFM_INTREQ_IRQ078MON_USB_DRQ_INT3         *((volatile  uint8_t *)(0x4262678CUL))
#define bFM4_INTREQ_IRQ078MON_USB_DRQ_INT3        *((volatile  uint8_t *)(0x4262678CUL))
#define bFM_INTREQ_IRQ078MON_USB_DRQ_INT4         *((volatile  uint8_t *)(0x42626790UL))
#define bFM4_INTREQ_IRQ078MON_USB_DRQ_INT4        *((volatile  uint8_t *)(0x42626790UL))

#define bFM_INTREQ_IRQ079MON_USB_INT0             *((volatile  uint8_t *)(0x42626800UL))
#define bFM4_INTREQ_IRQ079MON_USB_INT0            *((volatile  uint8_t *)(0x42626800UL))
#define bFM_INTREQ_IRQ079MON_USB_INT1             *((volatile  uint8_t *)(0x42626804UL))
#define bFM4_INTREQ_IRQ079MON_USB_INT1            *((volatile  uint8_t *)(0x42626804UL))
#define bFM_INTREQ_IRQ079MON_USB_INT2             *((volatile  uint8_t *)(0x42626808UL))
#define bFM4_INTREQ_IRQ079MON_USB_INT2            *((volatile  uint8_t *)(0x42626808UL))
#define bFM_INTREQ_IRQ079MON_USB_INT3             *((volatile  uint8_t *)(0x4262680CUL))
#define bFM4_INTREQ_IRQ079MON_USB_INT3            *((volatile  uint8_t *)(0x4262680CUL))
#define bFM_INTREQ_IRQ079MON_USB_INT4             *((volatile  uint8_t *)(0x42626810UL))
#define bFM4_INTREQ_IRQ079MON_USB_INT4            *((volatile  uint8_t *)(0x42626810UL))
#define bFM_INTREQ_IRQ079MON_USB_INT5             *((volatile  uint8_t *)(0x42626814UL))
#define bFM4_INTREQ_IRQ079MON_USB_INT5            *((volatile  uint8_t *)(0x42626814UL))

#define bFM_INTREQ_IRQ080MON_CANINT               *((volatile  uint8_t *)(0x42626880UL))
#define bFM4_INTREQ_IRQ080MON_CANINT              *((volatile  uint8_t *)(0x42626880UL))

#define bFM_INTREQ_IRQ081MON_CANINT               *((volatile  uint8_t *)(0x42626900UL))
#define bFM4_INTREQ_IRQ081MON_CANINT              *((volatile  uint8_t *)(0x42626900UL))

#define bFM_INTREQ_IRQ082MON_MACSBD               *((volatile  uint8_t *)(0x42626980UL))
#define bFM4_INTREQ_IRQ082MON_MACSBD              *((volatile  uint8_t *)(0x42626980UL))
#define bFM_INTREQ_IRQ082MON_MACPMT               *((volatile  uint8_t *)(0x42626984UL))
#define bFM4_INTREQ_IRQ082MON_MACPMT              *((volatile  uint8_t *)(0x42626984UL))
#define bFM_INTREQ_IRQ082MON_MACLPI               *((volatile  uint8_t *)(0x42626988UL))
#define bFM4_INTREQ_IRQ082MON_MACLPI              *((volatile  uint8_t *)(0x42626988UL))

#define bFM_INTREQ_IRQ083MON_DMACINT              *((volatile  uint8_t *)(0x42626A00UL))
#define bFM4_INTREQ_IRQ083MON_DMACINT             *((volatile  uint8_t *)(0x42626A00UL))

#define bFM_INTREQ_IRQ084MON_DMACINT              *((volatile  uint8_t *)(0x42626A80UL))
#define bFM4_INTREQ_IRQ084MON_DMACINT             *((volatile  uint8_t *)(0x42626A80UL))

#define bFM_INTREQ_IRQ085MON_DMACINT              *((volatile  uint8_t *)(0x42626B00UL))
#define bFM4_INTREQ_IRQ085MON_DMACINT             *((volatile  uint8_t *)(0x42626B00UL))

#define bFM_INTREQ_IRQ086MON_DMACINT              *((volatile  uint8_t *)(0x42626B80UL))
#define bFM4_INTREQ_IRQ086MON_DMACINT             *((volatile  uint8_t *)(0x42626B80UL))

#define bFM_INTREQ_IRQ087MON_DMACINT              *((volatile  uint8_t *)(0x42626C00UL))
#define bFM4_INTREQ_IRQ087MON_DMACINT             *((volatile  uint8_t *)(0x42626C00UL))

#define bFM_INTREQ_IRQ088MON_DMACINT              *((volatile  uint8_t *)(0x42626C80UL))
#define bFM4_INTREQ_IRQ088MON_DMACINT             *((volatile  uint8_t *)(0x42626C80UL))

#define bFM_INTREQ_IRQ089MON_DMACINT              *((volatile  uint8_t *)(0x42626D00UL))
#define bFM4_INTREQ_IRQ089MON_DMACINT             *((volatile  uint8_t *)(0x42626D00UL))

#define bFM_INTREQ_IRQ090MON_DMACINT              *((volatile  uint8_t *)(0x42626D80UL))
#define bFM4_INTREQ_IRQ090MON_DMACINT             *((volatile  uint8_t *)(0x42626D80UL))

#define bFM_INTREQ_IRQ091MON_DSTCINT0             *((volatile  uint8_t *)(0x42626E00UL))
#define bFM4_INTREQ_IRQ091MON_DSTCINT0            *((volatile  uint8_t *)(0x42626E00UL))
#define bFM_INTREQ_IRQ091MON_DSTCINT1             *((volatile  uint8_t *)(0x42626E04UL))
#define bFM4_INTREQ_IRQ091MON_DSTCINT1            *((volatile  uint8_t *)(0x42626E04UL))

#define bFM_INTREQ_IRQ092MON_EXTINT0              *((volatile  uint8_t *)(0x42626E80UL))
#define bFM4_INTREQ_IRQ092MON_EXTINT0             *((volatile  uint8_t *)(0x42626E80UL))
#define bFM_INTREQ_IRQ092MON_EXTINT1              *((volatile  uint8_t *)(0x42626E84UL))
#define bFM4_INTREQ_IRQ092MON_EXTINT1             *((volatile  uint8_t *)(0x42626E84UL))
#define bFM_INTREQ_IRQ092MON_EXTINT2              *((volatile  uint8_t *)(0x42626E88UL))
#define bFM4_INTREQ_IRQ092MON_EXTINT2             *((volatile  uint8_t *)(0x42626E88UL))
#define bFM_INTREQ_IRQ092MON_EXTINT3              *((volatile  uint8_t *)(0x42626E8CUL))
#define bFM4_INTREQ_IRQ092MON_EXTINT3             *((volatile  uint8_t *)(0x42626E8CUL))

#define bFM_INTREQ_IRQ093MON_EXTINT0              *((volatile  uint8_t *)(0x42626F00UL))
#define bFM4_INTREQ_IRQ093MON_EXTINT0             *((volatile  uint8_t *)(0x42626F00UL))
#define bFM_INTREQ_IRQ093MON_EXTINT1              *((volatile  uint8_t *)(0x42626F04UL))
#define bFM4_INTREQ_IRQ093MON_EXTINT1             *((volatile  uint8_t *)(0x42626F04UL))
#define bFM_INTREQ_IRQ093MON_EXTINT2              *((volatile  uint8_t *)(0x42626F08UL))
#define bFM4_INTREQ_IRQ093MON_EXTINT2             *((volatile  uint8_t *)(0x42626F08UL))
#define bFM_INTREQ_IRQ093MON_EXTINT3              *((volatile  uint8_t *)(0x42626F0CUL))
#define bFM4_INTREQ_IRQ093MON_EXTINT3             *((volatile  uint8_t *)(0x42626F0CUL))

#define bFM_INTREQ_IRQ094MON_EXTINT0              *((volatile  uint8_t *)(0x42626F80UL))
#define bFM4_INTREQ_IRQ094MON_EXTINT0             *((volatile  uint8_t *)(0x42626F80UL))
#define bFM_INTREQ_IRQ094MON_EXTINT1              *((volatile  uint8_t *)(0x42626F84UL))
#define bFM4_INTREQ_IRQ094MON_EXTINT1             *((volatile  uint8_t *)(0x42626F84UL))
#define bFM_INTREQ_IRQ094MON_EXTINT2              *((volatile  uint8_t *)(0x42626F88UL))
#define bFM4_INTREQ_IRQ094MON_EXTINT2             *((volatile  uint8_t *)(0x42626F88UL))
#define bFM_INTREQ_IRQ094MON_EXTINT3              *((volatile  uint8_t *)(0x42626F8CUL))
#define bFM4_INTREQ_IRQ094MON_EXTINT3             *((volatile  uint8_t *)(0x42626F8CUL))

#define bFM_INTREQ_IRQ095MON_EXTINT0              *((volatile  uint8_t *)(0x42627000UL))
#define bFM4_INTREQ_IRQ095MON_EXTINT0             *((volatile  uint8_t *)(0x42627000UL))
#define bFM_INTREQ_IRQ095MON_EXTINT1              *((volatile  uint8_t *)(0x42627004UL))
#define bFM4_INTREQ_IRQ095MON_EXTINT1             *((volatile  uint8_t *)(0x42627004UL))
#define bFM_INTREQ_IRQ095MON_EXTINT2              *((volatile  uint8_t *)(0x42627008UL))
#define bFM4_INTREQ_IRQ095MON_EXTINT2             *((volatile  uint8_t *)(0x42627008UL))
#define bFM_INTREQ_IRQ095MON_EXTINT3              *((volatile  uint8_t *)(0x4262700CUL))
#define bFM4_INTREQ_IRQ095MON_EXTINT3             *((volatile  uint8_t *)(0x4262700CUL))

#define bFM_INTREQ_IRQ096MON_QPRCINT0             *((volatile  uint8_t *)(0x42627080UL))
#define bFM4_INTREQ_IRQ096MON_QPRCINT0            *((volatile  uint8_t *)(0x42627080UL))
#define bFM_INTREQ_IRQ096MON_QPRCINT1             *((volatile  uint8_t *)(0x42627084UL))
#define bFM4_INTREQ_IRQ096MON_QPRCINT1            *((volatile  uint8_t *)(0x42627084UL))
#define bFM_INTREQ_IRQ096MON_QPRCINT2             *((volatile  uint8_t *)(0x42627088UL))
#define bFM4_INTREQ_IRQ096MON_QPRCINT2            *((volatile  uint8_t *)(0x42627088UL))
#define bFM_INTREQ_IRQ096MON_QPRCINT3             *((volatile  uint8_t *)(0x4262708CUL))
#define bFM4_INTREQ_IRQ096MON_QPRCINT3            *((volatile  uint8_t *)(0x4262708CUL))
#define bFM_INTREQ_IRQ096MON_QPRCINT4             *((volatile  uint8_t *)(0x42627090UL))
#define bFM4_INTREQ_IRQ096MON_QPRCINT4            *((volatile  uint8_t *)(0x42627090UL))
#define bFM_INTREQ_IRQ096MON_QPRCINT5             *((volatile  uint8_t *)(0x42627094UL))
#define bFM4_INTREQ_IRQ096MON_QPRCINT5            *((volatile  uint8_t *)(0x42627094UL))

#define bFM_INTREQ_IRQ097MON_QPRCINT0             *((volatile  uint8_t *)(0x42627100UL))
#define bFM4_INTREQ_IRQ097MON_QPRCINT0            *((volatile  uint8_t *)(0x42627100UL))
#define bFM_INTREQ_IRQ097MON_QPRCINT1             *((volatile  uint8_t *)(0x42627104UL))
#define bFM4_INTREQ_IRQ097MON_QPRCINT1            *((volatile  uint8_t *)(0x42627104UL))
#define bFM_INTREQ_IRQ097MON_QPRCINT2             *((volatile  uint8_t *)(0x42627108UL))
#define bFM4_INTREQ_IRQ097MON_QPRCINT2            *((volatile  uint8_t *)(0x42627108UL))
#define bFM_INTREQ_IRQ097MON_QPRCINT3             *((volatile  uint8_t *)(0x4262710CUL))
#define bFM4_INTREQ_IRQ097MON_QPRCINT3            *((volatile  uint8_t *)(0x4262710CUL))
#define bFM_INTREQ_IRQ097MON_QPRCINT4             *((volatile  uint8_t *)(0x42627110UL))
#define bFM4_INTREQ_IRQ097MON_QPRCINT4            *((volatile  uint8_t *)(0x42627110UL))
#define bFM_INTREQ_IRQ097MON_QPRCINT5             *((volatile  uint8_t *)(0x42627114UL))
#define bFM4_INTREQ_IRQ097MON_QPRCINT5            *((volatile  uint8_t *)(0x42627114UL))

#define bFM_INTREQ_IRQ098MON_BTINT0               *((volatile  uint8_t *)(0x42627180UL))
#define bFM4_INTREQ_IRQ098MON_BTINT0              *((volatile  uint8_t *)(0x42627180UL))
#define bFM_INTREQ_IRQ098MON_BTINT1               *((volatile  uint8_t *)(0x42627184UL))
#define bFM4_INTREQ_IRQ098MON_BTINT1              *((volatile  uint8_t *)(0x42627184UL))

#define bFM_INTREQ_IRQ099MON_BTINT0               *((volatile  uint8_t *)(0x42627200UL))
#define bFM4_INTREQ_IRQ099MON_BTINT0              *((volatile  uint8_t *)(0x42627200UL))
#define bFM_INTREQ_IRQ099MON_BTINT1               *((volatile  uint8_t *)(0x42627204UL))
#define bFM4_INTREQ_IRQ099MON_BTINT1              *((volatile  uint8_t *)(0x42627204UL))

#define bFM_INTREQ_IRQ100MON_BTINT0               *((volatile  uint8_t *)(0x42627280UL))
#define bFM4_INTREQ_IRQ100MON_BTINT0              *((volatile  uint8_t *)(0x42627280UL))
#define bFM_INTREQ_IRQ100MON_BTINT1               *((volatile  uint8_t *)(0x42627284UL))
#define bFM4_INTREQ_IRQ100MON_BTINT1              *((volatile  uint8_t *)(0x42627284UL))

#define bFM_INTREQ_IRQ101MON_BTINT0               *((volatile  uint8_t *)(0x42627300UL))
#define bFM4_INTREQ_IRQ101MON_BTINT0              *((volatile  uint8_t *)(0x42627300UL))
#define bFM_INTREQ_IRQ101MON_BTINT1               *((volatile  uint8_t *)(0x42627304UL))
#define bFM4_INTREQ_IRQ101MON_BTINT1              *((volatile  uint8_t *)(0x42627304UL))

#define bFM_INTREQ_IRQ102MON_BTINT0               *((volatile  uint8_t *)(0x42627380UL))
#define bFM4_INTREQ_IRQ102MON_BTINT0              *((volatile  uint8_t *)(0x42627380UL))
#define bFM_INTREQ_IRQ102MON_BTINT1               *((volatile  uint8_t *)(0x42627384UL))
#define bFM4_INTREQ_IRQ102MON_BTINT1              *((volatile  uint8_t *)(0x42627384UL))
#define bFM_INTREQ_IRQ102MON_BTINT2               *((volatile  uint8_t *)(0x42627388UL))
#define bFM4_INTREQ_IRQ102MON_BTINT2              *((volatile  uint8_t *)(0x42627388UL))
#define bFM_INTREQ_IRQ102MON_BTINT3               *((volatile  uint8_t *)(0x4262738CUL))
#define bFM4_INTREQ_IRQ102MON_BTINT3              *((volatile  uint8_t *)(0x4262738CUL))
#define bFM_INTREQ_IRQ102MON_BTINT4               *((volatile  uint8_t *)(0x42627390UL))
#define bFM4_INTREQ_IRQ102MON_BTINT4              *((volatile  uint8_t *)(0x42627390UL))
#define bFM_INTREQ_IRQ102MON_BTINT5               *((volatile  uint8_t *)(0x42627394UL))
#define bFM4_INTREQ_IRQ102MON_BTINT5              *((volatile  uint8_t *)(0x42627394UL))
#define bFM_INTREQ_IRQ102MON_BTINT6               *((volatile  uint8_t *)(0x42627398UL))
#define bFM4_INTREQ_IRQ102MON_BTINT6              *((volatile  uint8_t *)(0x42627398UL))
#define bFM_INTREQ_IRQ102MON_BTINT7               *((volatile  uint8_t *)(0x4262739CUL))
#define bFM4_INTREQ_IRQ102MON_BTINT7              *((volatile  uint8_t *)(0x4262739CUL))

#define bFM_INTREQ_IRQ103MON_MFSINT8_RX           *((volatile  uint8_t *)(0x42627400UL))
#define bFM4_INTREQ_IRQ103MON_MFSINT8_RX          *((volatile  uint8_t *)(0x42627400UL))

#define bFM_INTREQ_IRQ104MON_MFSINT8_TX           *((volatile  uint8_t *)(0x42627480UL))
#define bFM4_INTREQ_IRQ104MON_MFSINT8_TX          *((volatile  uint8_t *)(0x42627480UL))
#define bFM_INTREQ_IRQ104MON_MFSINT8_STATUS       *((volatile  uint8_t *)(0x42627484UL))
#define bFM4_INTREQ_IRQ104MON_MFSINT8_STATUS      *((volatile  uint8_t *)(0x42627484UL))

#define bFM_INTREQ_IRQ105MON_MFSINT9_RX           *((volatile  uint8_t *)(0x42627500UL))
#define bFM4_INTREQ_IRQ105MON_MFSINT9_RX          *((volatile  uint8_t *)(0x42627500UL))

